In [ ]:
============EDA=========================
1) Pandas  : Data Frame application
2) Numpy   : Numerical Analysis(Mean.....sin,cos)
3) Matplotlib: use for ploting
4) Seaborn: use for ploting
5) Plotly: use for ploting
6) Bokhe: use for ploting

====================Machine Learning======================
1) Sk Learn (Sickit Learn)

=========================Deep Learning========================
1) Tensor Flow  (Google)
2) Keras        (Google)
3) PyTorch      (Facebook)
=======================NLP=================================
1) NLTK (Natural language tool kit)
2) Scipy

=======================BERT=================================
1) Transformer (Hugging Face ---> Google)

====================Google Models=======================
1) Specfic Google Packages

========================Azure ML===================
1) Azure Packages

======================Gen AI========================
1) Gemini Ai : Google
2) ChatGPT: Microsoft + OpenAi

===================Lang Chain===================
1) Lang Chain Packages

**Create a Data Frame using List**

In [2]:
import pandas as pd
names=["Ayush",'avinash','akash']
pd.DataFrame()                 #Empty dataframe with no rows and no columns

Empty DataFrame
Columns: []
Index: []

In [8]:
names=["Ayush",'avinash','akash']
pd.DataFrame(names)

         0
0    Ayush
1  avinash
2    akash

In [7]:
names=["Ayush",'avinash','akash']
age=[20,25,30]
pd.DataFrame(names,age)

          0
20    Ayush
25  avinash
30    akash

In [10]:
#Need to zip , then (data,index)
names=["Ayush",'avinash','akash']
age=[20,25,30]
marks=[90,98,97]
pd.DataFrame(zip(names,age,marks))

         0   1   2
0    Ayush  20  90
1  avinash  25  98
2    akash  30  97

**Provide The Column Names**

In [13]:
names=["Ayush",'avinash','akash']
age=[20,25,30]
pd.DataFrame(zip(names,age),columns=['Name','Age'])

      Name  Age
0    Ayush   20
1  avinash   25
2    akash   30

In [15]:
#Need to zip , then (data,index)
names=["Ayush",'avinash','akash']
age=[20,25,30]
marks=[90,98,97]
df=pd.DataFrame(zip(names,age,marks),columns=['Names','Age','Marks'])

In [16]:
type(df)

pandas.core.frame.DataFrame

$Step-4$

#Add new column
- if you want to add new column
- first you need to check existing df how many rows
- in above 3 rows, so need to create new df with 3 rows
- that list equate to df

In [17]:
jobs=['DS','DE','DA']
df['Jobs']=jobs                 #Same for update column, or create new column
df

     Names  Age  Marks Jobs
0    Ayush   20     90   DS
1  avinash   25     98   DE
2    akash   30     97   DA

In [18]:
df['Age']=[35,40,45]
df

     Names  Age  Marks Jobs
0    Ayush   35     90   DS
1  avinash   40     98   DE
2    akash   45     97   DA

$Step-5$

- How to change the index

In [32]:
#Need to zip , then (data,index)
names=["Ayush",'avinash','akash']
age=[20,25,30]
marks=[90,98,97]
index=['A','B','C']
df=pd.DataFrame(zip(names,age,marks),index,columns=['Names','Age','Marks'])
df

     Names  Age  Marks
A    Ayush   20     90
B  avinash   25     98
C    akash   30     97

**Note**

- No of list == no of columns
- No of values == no of rows
- when you create the data all the list must be in same length otherwise error

$Step-7$

**Shape**

- No of rows and no of columns

In [24]:
df.shape

(3, 3)

In [ ]:
# Matrix 3 rows 3 columns

In [26]:
print("No of rows", df.shape[0])
print("No of columns", df.shape[1])

No of rows 3
No of columns 3

$Step-8$

- How to drop the column

- In order to drop column we require 3 parameters, 
- column name -which to drop,
- axis  - axis =0(means dropping rows), axis=1 (column)
- inplace -> we are dropping column, means we are modifing df, so this modification we want to keep in same variable or diff variable
- if want to keep in same variable, then inplace=True

In [27]:
df.drop('Marks',axis=1,inplace=True)

In [28]:
df

     Names  Age
A    Ayush   20
B  avinash   25
C    akash   30

In [29]:
df.drop('Age',axis=1)    # only Name came

     Names
A    Ayush
B  avinash
C    akash

In [30]:
df

     Names  Age
A    Ayush   20
B  avinash   25
C    akash   30

In [31]:
df1=df.drop('Age',axis=1)    
df1

     Names
A    Ayush
B  avinash
C    akash

$Step-9$

- Delete Multiple Columns

In [37]:
df.drop(['Age','Marks'],axis=1)

     Names
A    Ayush
B  avinash
C    akash

$Step-10$

- Drop The rows

In [39]:
df.drop('B',axis=0)

   Names  Age  Marks
A  Ayush   20     90
C  akash   30     97

$Step-11$

- How to save in local (DF)
- Generally df are of two types , csv (comma separated value)  , excel

In [40]:
# here data is file name, location same as this file
df.to_csv('data.csv')

In [41]:
df.to_csv('data1.csv',index=False)

$Now to Excel$

In [42]:
df.to_excel('dataExcel.xlsx')

In [43]:
df.to_excel('dataExcel1.xlsx',index=False)

In [44]:
# excel 5kb so not to use
# csv 1kb, good to use

**How to read a data frame**

- location
- filename
- extension

In [1]:
import pandas as pd

In [2]:
pd.read_csv('data1.csv')

     Names  Age  Marks
0    Ayush   20     90
1  avinash   25     98
2    akash   30     97

In [4]:
pd.read_excel('dataExcel.xlsx')

  Unnamed: 0    Names  Age  Marks
0          A    Ayush   20     90
1          B  avinash   25     98
2          C    akash   30     97

**Create data frame using dictionary**

In [5]:
names=["Ayush",'avinash','akash']
age=[20,25,30]
pd.DataFrame(zip(names,age),columns=['Name','Age'])

      Name  Age
0    Ayush   20
1  avinash   25
2    akash   30

In [7]:
dic={'Names':['Ayush','Akash','Avinash'],
    'Age':[20,35,46]}
dic

{'Names': ['Ayush', 'Akash', 'Avinash'], 'Age': [20, 35, 46]}

In [8]:
pd.DataFrame(dic)      # directly key = column, and value rows, no need to provide column names separately

     Names  Age
0    Ayush   20
1    Akash   35
2  Avinash   46

In [9]:
dict2={'Name':'Sandesh','Age':25,'Salary':54000}
pd.DataFrame(dict2)                  # ValueError: If using all scalar values, you must pass an index

ValueError: If using all scalar values, you must pass an index

In [11]:
dict2={'Name':'Sandesh','Age':25,'Salary':54000}
pd.DataFrame(dict2,index=[1])              # we need to pass index to display

      Name  Age  Salary
1  Sandesh   25   54000